{"timestamp": "2025-02-28T20:16:35.103869", "data": {"title": "The GitHub Blog", "entries": [{"title": "Community managers in action: Leading a developer community for good", "link": "https://github.blog/open-source/social-impact/community-managers-in-action-leading-a-developer-community-for-good/", "description": "GitHub’s Digital Public Goods Open Source Community Manager Program just wrapped up a second successful year, helping Community Managers gain experience in using open source for good.\nThe post Community managers in action: Leading a developer community for good appeared first on The GitHub Blog.", "published": "2025-02-25T17:00:18Z", "author": "Cynthia Lo"}, {"title": "How to debug code with GitHub Copilot", "link": "https://github.blog/ai-and-ml/github-copilot/how-to-debug-code-with-github-copilot/", "description": "GitHub Copilot can streamline your debugging process by troubleshooting in your IDE, analyzing pull requests, and more, helping you tackle issues faster and more robustly. \nThe post How to debug code with GitHub Copilot appeared first on The GitHub Blog.", "published": "2025-02-21T17:00:49Z", "author": "Jeimy Ruiz"}, {"title": "Engaging with the developer community on our approach to content moderation", "link": "https://github.blog/news-insights/policy-news-and-insights/engaging-with-the-developer-community-on-our-approach-to-content-moderation/", "description": "We share the full year 2024 data update on our Transparency Center and highlight how developers can engage with us on our site policies and content moderation.\nThe post Engaging with the developer community on our approach to content moderation appeared first on The GitHub Blog.", "published": "2025-02-20T17:00:22Z", "author": "Margaret Tucker"}, {"title": "Support the open source projects you love this Valentine’s Day", "link": "https://github.blog/open-source/support-the-open-source-projects-you-love-this-valentines-day/", "description": "Show your appreciation to the open source projects you love. You can help provide much-needed support to the critical but often underfunded projects that keep your infrastructure running smoothly. And remember—every day is a perfect day to support open source! 💖\nThe post Support the open source projects you love this Valentine’s Day appeared first on The GitHub Blog.", "published": "2025-02-14T17:00:04Z", "author": "Martin Woodward"}, {"title": "GitHub Availability Report: January 2025", "link": "https://github.blog/news-insights/company-news/github-availability-report-january-2025/", "description": "In January, we experienced two incidents that resulted in degraded performance across GitHub services. \nThe post GitHub Availability Report: January 2025 appeared first on The GitHub Blog.", "published": "2025-02-12T20:49:36Z", "author": "Jakub Oleksy"}, {"title": "How GitHub uses CodeQL to secure GitHub", "link": "https://github.blog/engineering/how-github-uses-codeql-to-secure-github/", "description": "How GitHub’s Product Security Engineering team manages our CodeQL implementation at scale and how you can, too.\nThe post How GitHub uses CodeQL to secure GitHub appeared first on The GitHub Blog.", "published": "2025-02-12T17:00:04Z", "author": "Brandon Stewart"}, {"title": "How to refactor code with GitHub Copilot", "link": "https://github.blog/ai-and-ml/github-copilot/how-to-refactor-code-with-github-copilot/", "description": "Discover how to use GitHub Copilot to refactor your code and see samples of it in action.\nThe post How to refactor code with GitHub Copilot appeared first on The GitHub Blog.", "published": "2025-02-11T17:00:05Z", "author": "Anthony Grutta"}, {"title": "From finding to fixing: GitHub Advanced Security integrates Endor Labs SCA", "link": "https://github.blog/security/from-finding-to-fixing-github-advanced-security-integrates-endor-labs-sca/", "description": "The partnership between GitHub and Endor Labs enables application security engineers and developers to drastically reduce time spent on open source vulnerabilities, and gives them the tools to go from finding to fixing.\nThe post From finding to fixing: GitHub Advanced Security integrates Endor Labs SCA appeared first on The GitHub Blog.", "published": "2025-02-07T17:00:17Z", "author": "Mario Rodriguez"}, {"title": "GitHub Copilot: The agent awakens", "link": "https://github.blog/news-insights/product-news/github-copilot-the-agent-awakens/", "description": "Introducing agent mode for GitHub Copilot in VS Code, announcing the general availability of Copilot Edits, and providing a first look at our SWE agent.\nThe post GitHub Copilot: The agent awakens appeared first on The GitHub Blog.", "published": "2025-02-06T17:04:30Z", "author": "Thomas Dohmke"}, {"title": "5 tips for promoting your open source project", "link": "https://github.blog/open-source/maintainers/5-tips-for-promoting-your-open-source-project/", "description": "Three open source experts offer their advice on sharing open source projects with the world.\nThe post 5 tips for promoting your open source project appeared first on The GitHub Blog.", "published": "2025-02-06T17:00:07Z", "author": "Klint Finley"}]}}