{"timestamp": "2025-02-28T20:16:32.998279", "data": {"title": "We Work Remotely: Remote jobs in design, programming, marketing and more", "entries": [{"title": "Silverfin: Ruby Engineer", "link": "https://weworkremotely.com/remote-jobs/silverfin-ruby-engineer", "description": "\n\nHeadquarters: Gent, Belgium\n    URL: https://silverfin.com/\n\nWe start with the cliff notes about the position. If this appeals to you, continue reading for a longer text about working at Silverfin and your role 👇At Silverfin, we're an equal opportunity employer and value diversity at our company. Although we know we’re not perfect yet, we are working hard on it and always open for your feedback.According to our vision to build a diverse, equitable and inclusive organisation, our policy is to o...", "published": "Wed, 08 Jan 2025 11:12:12 +0000", "author": "Unknown"}, {"title": "Storetasker: Senior Shopify Developer (Remote + Flexible)", "link": "https://weworkremotely.com/remote-jobs/storetasker-senior-shopify-developer-remote-flexible-3", "description": "\n\nHeadquarters: Brooklyn, NY\n    URL: https://resources.storetasker.com/become-an-expert?apply=true&source=weworkremotely_best_2021\n\nShopify developers love to freelance with Storetasker.\n\nEndless, quality clients: from well known DTC brands to top agencies. \n\nFully remote, flexible: work as much or as little as you want, wherever you want. \n\nA talented and helpful community: it's freelance (with a team).\n\nEarn $100-$200 per hour: pick your clients, and send your own quotes or retainers. \n\nWe've...", "published": "Mon, 13 May 2024 03:14:30 +0000", "author": "Unknown"}, {"title": "EveryoneSocial: Backend Engineer (profitable startup, veteran team, market leader)", "link": "https://weworkremotely.com/remote-jobs/everyonesocial-backend-engineer-profitable-startup-veteran-team-market-leader", "description": "\n\nHeadquarters: Austin, TX\n    URL: https://everyonesocial.com\n\n\nStart here!  2min video message from our Co-Founder & CEO, Cameron Brain.\nHi! We’re EveryoneSocial, the #1 employee advocacy platform in the world. Our products are used by Amazon, NVIDIA, Meta and others market leading companies to activate their employees as marketers, to share company news and updates on social media. Word of mouth for the 21st century! EveryoneSocial is a startup, we’re profitable, and shipping high-quality, in...", "published": "Thu, 06 Feb 2025 20:50:59 +0000", "author": "Unknown"}, {"title": "Fingerprint: Senior iOS Security Engineer", "link": "https://weworkremotely.com/remote-jobs/fingerprint-senior-ios-security-engineer", "description": "\n\nHeadquarters: Chicago, IL\n    URL: https://fingerprint.com\n\n\nWe are seeking an experienced Senior iOS Developer with a strong background in Information Security to join our team. This role is ideal for a skilled developer who has built native iOS applications or libraries from scratch and has experience working with security protocols, cryptography, and frameworks that enhance security. The candidate should be highly proficient in Swift, and familiarity with Swift UI is preferred.\n\nKey Respons...", "published": "Tue, 07 Jan 2025 19:49:16 +0000", "author": "Unknown"}, {"title": "Elevate Labs: Senior Backend Engineer", "link": "https://weworkremotely.com/remote-jobs/elevate-labs-senior-backend-engineer-1", "description": "\n\nHeadquarters: Fully Remote\n    URL: https://www.elevateapp.com/\n\nAbout Us:Elevate Labs is on a mission to improve people's minds.\nWe’ve helped millions of people around the world learn and improve concrete communication, memory, and math skills through Elevate, our first mobile app which has won Apple's App of the Year Award and been downloaded more than 60 million times. With Balance, our second mobile app and winner of Google's Best App award, we’ve personalized meditation and made it free f...", "published": "Thu, 06 Feb 2025 18:09:33 +0000", "author": "Unknown"}, {"title": "MailerLite: Senior Test Automation Engineer", "link": "https://weworkremotely.com/remote-jobs/mailerlite-senior-test-automation-engineer", "description": "\nHeadquarters: USA\n    URL: https://www.mailerlite.com/company-values\n\n\nMailerLite is one of the fastest-growing email marketing services. We help more than 1 million businesses around the world to keep in touch with their customers. Today, we are a team of more than 160 dreamers, adventurers, and world travelers passionate about what we do and believe in. And we are ready for another talented person to join the party.\nWe’re looking for a Senior Test Automation Engineer to help us ensure the qua...", "published": "Thu, 06 Feb 2025 17:52:43 +0000", "author": "Unknown"}, {"title": "Maharishi Foundation International: Senior Mobile Engineer", "link": "https://weworkremotely.com/remote-jobs/maharishi-foundation-international-senior-mobile-engineer", "description": "\nHeadquarters: Remote\n    URL: https://www.maharishi.foundation/\n\nJob Summary\nWe are looking for a senior mobile engineer with a proven track record of developing React Native mobile applications. As we are a small but growing team, you will be responsible for the maintenance and support of existing app features as well as planning and scoping new feature additions and iterations.You will be working closely with our team to maintain, improve, and extend a meditation and lifestyle application. Ap...", "published": "Tue, 07 Jan 2025 13:46:40 +0000", "author": "Unknown"}, {"title": "Scalable Path: Machine Learning Engineer for Agentic AI", "link": "https://weworkremotely.com/remote-jobs/scalable-path-machine-learning-engineer-for-agentic-ai", "description": "\n\nHeadquarters: San Francisco, California\n    URL: http://www.scalablepath.com\n\n\nOVERVIEW:A client of Scalable Path is expanding its educational web application into the private sector, and it needs help improving the quality and performance of its existing application. This involves creating automated tests, implementing logging, and improving the dev team's practices.The client is a Canadian company that has an existing web application that helps young students learn French as a second languag...", "published": "Thu, 06 Feb 2025 11:24:27 +0000", "author": "Unknown"}, {"title": "Elite Software Automation: Software Design Engineer", "link": "https://weworkremotely.com/remote-jobs/elite-software-automation-software-design-engineer", "description": "\n\nHeadquarters: Virtual\n    URL: https://jobs.elitesoftwareautomation.com/\n\n\nSoftware Design Engineer(Remote, Full-Time, Anywhere in the World)Starting Pay: USD $50-100K/yrExact offer will be formulated based on your demonstrated skills and abilities at the time of hiring process evaluation, taking into account both development and design skills. Further pay promotions are available based on performance once on the job, with exceptionally good performance enabling promotion substantially beyond ...", "published": "Thu, 06 Feb 2025 03:44:52 +0000", "author": "Unknown"}, {"title": "Outlier AI: Remote Coding Expertise for AI Training (Dutch)", "link": "https://weworkremotely.com/remote-jobs/outlier-ai-remote-coding-expertise-for-ai-training-dutch", "description": "\n\nHeadquarters: San Francisco\n    URL: https://outlier.ai\n\nAbout the opportunity:\nOutlier is looking for talented coders to help train generative artificial intelligence models\nThis freelance opportunity is remote and hours are flexible, so you can work whenever is best for you\nYou may contribute your expertise by…\nCrafting and answering questions related to computer science in order to help train AI models\nEvaluating and ranking code generated by AI models\nExamples of desirable expertise:\nCurre...", "published": "Thu, 06 Feb 2025 01:18:26 +0000", "author": "Unknown"}]}}