{"timestamp": "2025-02-28T20:16:31.603774", "data": {"title": "Remote OK", "entries": [{"title": "PPC Manager Europe Spanish Speaking", "link": "https://remoteOK.com/remote-jobs/remote-ppc-manager-europe-spanish-speaking-hostaway-1085289", "description": "NOTE: This is a FULLY remote role, but the candidate must be within Europe to collaborate with their team, peers, and internal customers. You do not have to be in the specific city shown in this listing, but please only apply if you are physically based within Europe.Hostaway is a SaaS startup that is transforming the vacation rental industry. With innovative solutions and partnerships with giants like Airbnb, VRBO, and Booking, we're taking on the competition and winning. Leveraging our custome...", "published": "2025-02-27T22:03:55+00:00", "author": "Unknown"}, {"title": "Marketing Associate Product", "link": "https://remoteOK.com/remote-jobs/remote-marketing-associate-product-prelim-1085288", "description": "About PrelimPrelim is a fast-growing, remote-first startup revolutionizing the banking industry. Our platform transforms how banks onboard customers, providing innovative solutions for both online and in-branch experiences. Our team, distributed across the U.S., is driven by a single mission: to simplify banking access for everyone, one institution at a time.At Prelim, we cultivate a high-performance culture where talented individuals thrive. We’re not just building technology—we’re reimagining ...", "published": "2025-02-27T22:03:45+00:00", "author": "Unknown"}, {"title": "Senior React Developer", "link": "https://remoteOK.com/remote-jobs/remote-senior-react-developer-bluelight-consulting-1085287", "description": "Are you an experienced software engineer with deep experience in building and shipping amazing products? Do you have high standards when it comes to code quality and user experiences? Are you the best developer on your team? Are you ready to work alongside the best engineers in the world for name-brand, industry-leading companies?Bluelight Consulting is seeking a React developer to join its growing team.As an engineer at Bluelight Consulting you will help our incredible clients achieve their tec...", "published": "2025-02-27T22:03:39+00:00", "author": "Unknown"}, {"title": "Senior Backend Developer Node", "link": "https://remoteOK.com/remote-jobs/remote-senior-backend-developer-node-tether-operations-limited-1085286", "description": "Tether, the founder of the first, largest, and most widely used stablecoin USD₮, is rapidly expanding into a wide range of sectors, including secure and unstoppable communication technologies, energy production, mining, and further fintech infrastructure. All of these themes share and are deeply rooted in the principles of Bitcoin, which include decentralization, resilience, openness, freedom, security, and scalability.Tether stablecoins are used to power a wide variety of enterprises, including...", "published": "2025-02-27T22:03:33+00:00", "author": "Unknown"}, {"title": "Power Apps Specialist", "link": "https://remoteOK.com/remote-jobs/remote-power-apps-specialist-dentalook-1085285", "description": " Are you passionate about automation, technology, and creating innovative solutions that make a real impact? Join Dentalook, a leading dental support organization that owns and operates clinics across Canada. We’re looking for a Power Apps, Power Automate, and SharePoint Specialist to join our team full-time, remotely from Amman, Jordan. ***This is a Remote/Work From Home based position. What You’ll Do  • Collaborate with our team to understand business needs and identify automation opportunitie...", "published": "2025-02-27T22:03:24+00:00", "author": "Unknown"}, {"title": "Staff Backend Engineer", "link": "https://remoteOK.com/remote-jobs/remote-staff-backend-engineer-notabene-1085284", "description": "About NotabeneNotabene is on a mission to make crypto a part of the everyday economy. Leading crypto organizations use our tools to reduce transaction risk and make crypto transfers safe. Working across three continents in eight countries, the Notabene team serves our fantastic community of 100+ customers, including financial institutions, fintechs, exchanges, and more. Our co-founders spearheaded foundational Self Sovereign Identity protocols and use-cases. This technology is key to the interna...", "published": "2025-02-27T22:03:17+00:00", "author": "Unknown"}, {"title": "Frontend Software Engineer", "link": "https://remoteOK.com/remote-jobs/remote-frontend-software-engineer-hackerrank-1085283", "description": "At HackerRank, we help over 2,500 of the most prestigious logos across industries find, hire, and upskill amazing developer talent using our SaaS-based Developer Skills Platform. We pioneered and continue to lead the developer skills market. At HackerRank, we are passionate about our mission to \"Change the world to value skills over pedigree. This position is full-time and Remote within the United States.As a Frontend Engineer, you will be pivotal in HackerRank’s mission to “Accelerate the World...", "published": "2025-02-27T22:03:02+00:00", "author": "Unknown"}, {"title": "Tutor Marketing Manager", "link": "https://remoteOK.com/remote-jobs/remote-tutor-marketing-manager-classdojo-1085282", "description": "ClassDojo's goal is to give every child on Earth an education they love.We started by building a powerful network for communication. ClassDojo’s flagship app is the #1 communication app connecting K-12 teachers, children, and families globally. Teachers use it to share what’s happening throughout the day through photos, videos, and messages that make parents feel like they’re there. It’s actively used in over 95% of US schools, reaching over 45 million children in 180 countries, with a team of j...", "published": "2025-02-27T22:02:55+00:00", "author": "Unknown"}, {"title": "Membership Activation Specialist", "link": "https://remoteOK.com/remote-jobs/remote-membership-activation-specialist-neura-health-1085281", "description": "At Neura Health, we rely on friendly and knowledgeable professionals to interact with prospective customers, help them learn about our services and encourage them to sign up. We’re looking for a highly skilled membership activation specialist to join our team, managing a large volume of inbound and outbound calls, emails, online chat inquiries and SMS messages. The ideal candidate will be a quick learner who can memorize scripts and adapt them when issues arise during a call, who is also mission...", "published": "2025-02-27T22:02:48+00:00", "author": "Unknown"}, {"title": "Solutions Engineer", "link": "https://remoteOK.com/remote-jobs/remote-solutions-engineer-notabene-1085280", "description": "About NotabeneWorking across three continents in eight countries, Notabene is a remote-first and globally distributed team of 40 employees on a mission to make cryptocurrency a part of the everyday economy. As a regulation technology (reg-tech) company, crypto organizations and traditional financial institutions alike use our tools to reduce transaction risk and make crypto transfers safe. Notabene is recognized as a vital enabler of the crypto ecosystem and, to date, we’ve processed over half a...", "published": "2025-02-27T22:02:35+00:00", "author": "Unknown"}]}}